Plan:

```
Terraform will perform the following actions:

  # aws_s3_bucket_versioning.fallback will be created
  + resource "aws_s3_bucket_versioning" "fallback" {
      + bucket = "staging-crates-io-fallback"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.index will be created
  + resource "aws_s3_bucket_versioning" "index" {
      + bucket = "staging-crates-io-index"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.static will be created
  + resource "aws_s3_bucket_versioning" "static" {
      + bucket = "staging-crates-io"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # fastly_service_compute.static will be updated in-place
  ~ resource "fastly_service_compute" "static" {
      ~ active_version = 98 -> (known after apply)
      ~ cloned_version = 98 -> (known after apply)
        id             = "liljrvY3Xt0CzNk0mpuLa7"
        name           = "static.staging.crates.io"
        # (4 unchanged attributes hidden)

      ~ package {
          ~ source_code_hash = "7f9c626cafb868e8fe86e75d5f139b91c921bd76ae11c675d76aaf1ee3b2bcf992652e793fd8a5c65bd4e16f6574c05b5ee05b0aa02a9ebf4571c11a77ecb2d8" -> "8b8af379556bf903249e431e3d4daa1d23e88a0080a0f7caed31be2e6d611232e7fb786195c48f100f38a051f1138d6c15b49eaaeae5da1aa2e79b4742b33fbb"
            # (1 unchanged attribute hidden)
        }

        # (8 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with aws_s3_bucket.static,
│   on s3-static.tf line 1, in resource "aws_s3_bucket" "static":
│    1: resource "aws_s3_bucket" "static" {
│
│ Use the aws_s3_bucket_lifecycle_configuration resource instead
│
│ (and 3 more similar warnings elsewhere)
```